; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_3 ?v2 - type_2 ?v4 - type_3)
 	      (pred_1 ?v1 - object ?v4 - type_3)
	      (pred_4 ?v2 - type_2 ?v5 - type_1)
	      (pred_2 ?v2 - type_2 ?v1 - object ?v5 - type_1))

   (:action op_1
       :parameters  (?v2 - type_2 ?v3 ?v7 - type_3)
       :precondition (and  (pred_3 ?v2 ?v3))
       :effect (and  (pred_3 ?v2 ?v7)
		     (not (pred_3 ?v2 ?v3))))

   (:action op_3
       :parameters (?v2 - type_2 ?v8 - object ?v6 - type_3 ?v5 - type_1)
       :precondition  (and  (pred_1 ?v8 ?v6) (pred_3 ?v2 ?v6) (pred_4 ?v2 ?v5))
       :effect (and (pred_2 ?v2 ?v8 ?v5)
		    (not (pred_1 ?v8 ?v6)) 
		    (not (pred_4 ?v2 ?v5))))

   (:action op_2
       :parameters (?v2 - type_2 ?v8 - object ?v6 - type_3 ?v5 - type_1)
       :precondition  (and  (pred_2 ?v2 ?v8 ?v5) (pred_3 ?v2 ?v6))
       :effect (and (pred_1 ?v8 ?v6)
		    (pred_4 ?v2 ?v5)
		    (not (pred_2 ?v2 ?v8 ?v5)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_07 - type_2
obj_03 obj_05 - type_1
obj_06 obj_09 obj_10 obj_08 - type_3
obj_04 obj_02 obj_01 - object)
(:init
(pred_3 obj_07 obj_08)
(pred_4 obj_07 obj_03)
(pred_4 obj_07 obj_05)
(pred_1 obj_04 obj_06)
(pred_1 obj_02 obj_09)
(pred_1 obj_01 obj_09)
)
(:goal
(and
(pred_1 obj_04 obj_08)
(pred_1 obj_02 obj_10)
(pred_1 obj_01 obj_09)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_2 obj_07 ?b obj_05))))
)
)

; plan
1. (op_1 obj_07 obj_08 obj_06)
   deleted: (pred_3 obj_07 obj_08)
   added: (pred_3 obj_07 obj_06)
   goals met: 1 of 3
2. (op_3 obj_07 obj_04 obj_06 obj_03)
   deleted: (pred_1 obj_04 obj_06) (pred_4 obj_07 obj_03)
   added: (pred_2 obj_07 obj_04 obj_03)
   goals met: 1 of 3
3. (op_1 obj_07 obj_06 obj_08)
   deleted: (pred_3 obj_07 obj_06)
   added: (pred_3 obj_07 obj_08)
   goals met: 1 of 3
4. (op_2 obj_07 obj_04 obj_08 obj_03)
   deleted: (pred_2 obj_07 obj_04 obj_03)
   added: (pred_1 obj_04 obj_08) (pred_4 obj_07 obj_03)
   goals met: 2 of 3
5. (op_1 obj_07 obj_08 obj_09)
   deleted: (pred_3 obj_07 obj_08)
   added: (pred_3 obj_07 obj_09)
   goals met: 2 of 3
6. (op_3 obj_07 obj_02 obj_09 obj_03)
   deleted: (pred_1 obj_02 obj_09) (pred_4 obj_07 obj_03)
   added: (pred_2 obj_07 obj_02 obj_03)
   goals met: 2 of 3
7. (op_1 obj_07 obj_09 obj_10)
   deleted: (pred_3 obj_07 obj_09)
   added: (pred_3 obj_07 obj_10)
   goals met: 2 of 3
8. (op_2 obj_07 obj_02 obj_10 obj_03)
   deleted: (pred_2 obj_07 obj_02 obj_03)
   added: (pred_1 obj_02 obj_10) (pred_4 obj_07 obj_03)
   goals met: 3 of 3
